Revit 2027 API
DuctPressureDropData.Density Property
 The density of the duct. Units: (kg/ft³).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Density { get; }
Public ReadOnly Property Density As Double
	Get
public:
property double Density {
	double get ();
}
member Density : float with get
Property Value
Double
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace